# Taps

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install Binaries
brew 'elixir'
brew 'git'
brew 'node'

# Development
brew 'python3'
brew 'neovim/neovim/neovim'
brew 'tmux'
brew 'wemux'
brew 'exercism'
brew 'reattach-to-user-namespace'

# Apps
cask 'appcleaner'
cask 'dropbox'
cask 'flux'
cask 'google-chrome'
cask 'iterm2'
cask 'postgres'
cask 'rescuetime'
cask 'sequel-pro'
cask 'sizeup'
cask 'skitch'
cask 'slack'
cask 'spotify'
cask 'spotify'

# Fonts
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
