# Taps

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install Binaries
brew 'elixir'
brew 'git'
brew 'node'

# Development
brew 'exercism'
brew 'neovim/neovim/neovim'
brew 'python3'
brew 'reattach-to-user-namespace'
brew 'tmux'
brew 'wine'
brew 'yarn'
cask 'devdocs'
cask 'postgres'

# Apps
cask '1password'
cask 'alfred'
cask 'appcleaner'
cask 'dropbox'
cask 'flux'
cask 'google-chrome'
cask 'irvue'
cask 'iterm2'
cask 'karabiner'
cask 'onyx'
cask 'postgres'
cask 'recordit'
cask 'rescuetime'
cask 'sequel-pro'
cask 'sizeup'
cask 'skitch'
cask 'slack'
cask 'spark'
cask 'spotify'
